/*


3人の女子高生の日常
--登場人物  
    シオン
    　活発元気系、あほの子（自覚有）

    ミツキ
    　引込思案、おとなしい、自己肯定感低い

    ソラ
    　クール系、無口、率直

--あらすじ
    起
    最近ミツキの元気がない気がしたシオンが、元気づけようとミツキの机の上に最近はやっている
    ゆるかわい～キャラクターものの消しゴムを置いた。
    
    承
    ミツキは翌日消しゴムに気づき、可愛さに癒されながら元気を取り戻す。
    しかしここでソラからの贈り物かな？と勘違いしてしまう。
    ミツキは気を使わせてしまったと思いながら、ソラにお返しがしたいと思って、その日から
    お弁当のおかずをソラに分けるようになる。
    「いつも菓子パンばっかりじゃ体に悪いよ～！お野菜も食べて！」
    
    ソラはミツキがおかずを分けてくれる事になぜ？と思いながらも受け取りつつ、そのおかずが
    実は苦手な食べ物だったことを言えずに受け取る。
    クールで大人なキャラで過ごしてきたし、食べ物の好き嫌いがあることを明かせずに毎回務めて明るく
    受け取っている。
    しかし1週間毎日苦手な野菜や甘い味付けの卵焼きを渡されついに次の週からは何かと理由をつけて
    ランチタイムに現れなくたってしまう。
    
    シオンはミツキが元気になったことにホッとしながらも、お昼休憩にミツキがソラへおかずを
    分けている姿を見て、何だけちょっと二人との距離を感じてしまう。
    （あれ、私もしかしていらない子？？）

    転
    1週間が過ぎた頃、お昼休憩にソラと会えないことが続いた。
    ミツキはもしかして迷惑だったのかも？と不安が顔に出ている。
    
    シオンは先週までは二人とも仲よさそうだったのに、ミツキもソラもお昼に誘うと
    気まずそうな顔をするようになってしまったことに気づく。
    （もしかして、本当に二人にとって私は邪魔ものだったのか？？ああ～私のバカバカ！）

    ソラは二人にごめん！と思いつつも下手なプライドが邪魔して正直になれずにいる。
    先生に呼ばれているだとか、部活の集まりが、などと嘘をつき続けていると、そのうち
    シオンも誘ってこなくなった。
    そのことにホッとしながらも、こんなしょうもないことで二人を傷つけている自分に嫌気がさした。
    （でも本当に。。。野菜苦手なんです。）    
    
    結
    その週の金曜日、3人のグループチャットにシオンからのメッセージ。
    「今日も一緒に帰るよね？」

    三人は互いに距離を感じながら、でもその距離の埋め方がわからないまま歩いた。
    気まずい沈黙のなか、三人ともがだれかなんでもいい、くだらない話を振ってくれないか？いつもみたいに！
    と思いながら黙々と、長く伸びた自分の影を踏みながら帰路につく。

    こんな感じのストーリーを、3人のキャラクターを1週間ずつで交代しながらそれぞれの視点で進めていく。
    最後の金曜日時点でエンディングで、1度エンディングに到達すると2週目から選択肢が登場するようにする。
    ハッピーエンドを目指して選択肢を選ぶ、みたいなゲーム。どう思う？
    
*/